#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//操作符练习
//int main()//算数操作符
//{
//	float a = 7;
//	float b = 2;
//	//int c = 0;
//	//c = a / b;//c=3
//	//c = a % b;//c=1
//	//c = a + b;//c=9;
//	//c = a - b;//c=5
//	//c = a * b; //c = 14;
//	float c = a / b;//得到的结果是小数：3.5
//	printf("%f\n", c);
//	return 0;
//}

//int main()//移位操作符
//{
//	//int a = 16;
//	//int b = 0;
//	//a=0000 0000 0000 0000 0000 0000 0001 0000 16
//	//b = a >> 1;//右移操作符--右边丢弃，左边补原符号位
//	//b=0000 0000 0000 0000 0000 0000 0000 1000 8
//	//b = a >> 2;
//	//b=0000 0000 0000 0000 0000 0000 0000 0100 4
//	//效果：右移一位，相当于除以2
//	//int a = -1;
//	//int b = 0;
//	//a--1000 0000 0000 0000 0000 0000 0000 0001 -- 原码
//	//    1111 1111 1111 1111 1111 1111 1111 1110 -- 反码
//	//    1111 1111 1111 1111 1111 1111 1111 1111 -- 补码
//	//b = a >> 1;
//	//b = a >> 2;
//	int a = 2;
//	int b = 0;
//	//a--0000 0000 0000 0000 0000 0000 0000 0010
//	b = a << 1;//左移一位，右边补0 -- 相当于乘以2
//	//b--0000 0000 0000 0000 0000 0000 0000 0100
//	printf("%d\n", b);
//	return 0;
//}

//int main()//位操作符
//{
//	int a = 3;
//	int b = 7;
//	int c = 0;
//	//c = a & b;//按位与 -- 同时为1才为1
//	//a -- 0000 0000 0000 0000 0000 0000 0000 0011
//	//b -- 0000 0000 0000 0000 0000 0000 0000 0111
//	//c -- 0000 0000 0000 0000 0000 0000 0000 0011
//	//c = a | b;//按位或 -- 同时为0才为0
//	//c -- 0000 0000 0000 0000 0000 0000 0000 0111
//	c = a ^ b;//按位异或 -- 相同为0，相异为1
//	//c -- 0000 0000 0000 0000 0000 0000 0000 0100
//	printf("%d\n", c);
//	return 0;
//}

//int main()//不使用第三个变量交换两个变量的值
//{
//	int a = 5;
//	int b = 3;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}

//int main()//编写代码实现求一个整数存储在内存中的二进制中的一的个数
//{
//	int a = 7;
//	int b = 1;
//	int count = 0;
//	int c = 0;
//	int i = 0;
//	int j = 0;
//	j = a;
//	for (i = 1; i <= 32; i++)
//	{
//		c = j & b;
//		if (c == 1)
//		{
//			count++;
//		}
//		j = a >> i;
//	}
//	printf("%d\n", count);
//	return 0;
//}

//int main()//赋值操作符
//{
//	int a = 150;
//	//a = 30;//赋一个新的值
//	//复合赋值符
//	a = 1;
//	//a += 2;//a=a+2 -- a=3
//	//a -= 2;//a=a-2;
//	a &= 1;//a=a&1;
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//	printf("%p %d\n", p, a);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	char c = 'r';
//	char* p = c;
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(c));
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof(p));
//	printf("%d\n", sizeof(char));
//	return 0;
//}

//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));//内部表达式不参与运算
//	printf("%d\n", sizeof(s));
//	return 0;
//}

int main()
{
	int a = 0;
	printf("%d\n", ~a);// ~ -- 按二进制位取反
	return 0;
}